{
  "links": [],
  "objective": "Elucidate basic computer networking; Demonstration of application layer protocols; Explain routers, IP and routing algorithms in the network layer",
  "outcomes": "Explain the use of computer networking and layering concepts; Explain the principles of application layer protocols",
  "units": [
    {
      "name": "Computer Networks and the Internet",
      "links": ["https://www.youtube.com/watch?v=qiQR5rTSshw"],
      "description": "Computer networking refers to interconnected computing devices that can exchange data and share resources with each other. These networked devices use a system of rules, called communications protocols, to transmit information over physical or wireless technologies.",
      "level": "Basic",
      "topics": [
        {
          "name": "What is the internet?",
          "duration": {
            "lecture": "35min",
            "Activity": "0"
          },
          "objectives": "To understand the basics of Computer networks and Internet",
          "outcomes": "You will understand the basics of Compute networks and Internet"
        },
        {
          "name": "The Network Edge",
          "duration": {
            "lecture": "40min",
            "Activity": "0"
          },
          "objectives": "To understand the basics of Network Edge",
          "outcomes": "You will understand the basics of Network Edge"
        },
        {
          "name": "The Network Core",
          "duration": {
            "lecture": "50min",
            "Activity": "0"
          },
          "objectives": "To understand the basics of Network Core",
          "outcomes": "You will understand the basics of Network Core"
        },
        {
          "name": "Delay, Loss and Throughput in packet-switched networks",
          "duration": {
            "lecture": "80min",
            "Activity": "0"
          },
          "objectives": "To understand the basics of Delay, Loss and Throughput in packet-switched networks",
          "outcomes": "You will understand the basics of Delay, Loss and Throughput in packet-switched networks"
        },
        {
          "name": "Protocol layers and their service models",
          "duration": {
            "lecture": "120",
            "Activity": "0"
          },
          "objectives": "To understand the basics of Protocol layers and their service models",
          "outcomes": "You will understand the basics of Protocol layers and their service models"
        }
      ]
    }
  ]
}
