{
	"subjects": [
		{
			"name": "Artificial Intelligence and Machine Learning",
			"links": [],
			"chapters": [
				{
					"name": "Introduction to Artificial Intelligence",
					"links": [],
					"description": "Introduction, what is AI, Strong Methods and weak Methods. \nUses and Limitations: Knowledge Representation: Need for good representation, semantic nets, Frames, , Search Spaces, Semantics Tress, Search Trees, Combinatorial Explosion, Problem reduction, Goal Trees, Combinatorial Explosion \nSelf-learning topics: Inheritance, Object oriented programming"
				},
				{
					"name": "Search Methodologies",
					"links": [],
					"description": "Introduction, Problem solving as search, Data driven or goal driven search, Generate and test, Properties of search methods, Depth First Iterative Deepening, Using Heuristics for Search, Hill Climbing, Best-First Search, Identifying Optimal Paths, Constraint Satisfaction search, Forward Checking, Local Search and Meta heuristics, Simulated Annealing. Genetic Algorithms for search, Real time A*, Bidirectional search, Nondeterministic search, non-chronological backtracking\nSelf-learning topics: Depth First Search, Breadth First Search, Implementing Depth-First and Breadth-First Search"
				},
				{
					"name": "Game Playing",
					"links": [],
					"description": "Game Trees, Minimax, Alpha beta pruning \nPrepositional and Predicate Logic: Introduction, what is Logic, Why Logic is used in Artificial Intelligence, Logical Operators, translating between English and Logic Notation, The deduction Theorem, Soundness, Completeness, Decidability, Monotonicity, Abduction and Inductive reasoning, Modal logics and possible worlds, Dealing with change. \nInference and Resolution for Problem Solving: Introduction, Resolution in prepositional logic: Applications of Resolution, Resolution in Predicate Logic, Normal forms for predicate logic, Skolemization, Resolution Algorithms, Resolution for problem solving,\nSelf-learning topics: Truth Tables: Not, And, Or, Implies, if, Complex Truth Tables, Tautology, Equivalence"
				},
				{
					"name": "Introduction to Machine Learning",
					"links": [],
					"description": "Introduction, Training Rote Learning, Learning Concepts, General-to-Specific Ordering, Version Spaces, Candidate Elimination, Inductive Bias, Decision-Tree Induction, The Problem of Overfitting, The Nearest Neighbor Algorithm, Backpropagation algorithms, Reinforcement Learning. \nNeural Networks: Introduction, Neurons, Perceptrons, Multilayer Neural Networks, Recurrent Networks, Unsupervised Learning Networks, Evolving Neural Networks.\nSelf-learning topics: Supervised Learning, Unsupervised Learning"
				},
				{
					"name": "Probabilistic Reasoning and Bayesian Belief Networks",
					"links": [],
					"description": "Introduction, Probabilistic Reasoning, Joint Probability Distributions, Bayes’ Theorem, Simple Bayesian Concept Learning, Bayesian Belief Networks, The Noisy-V Function, Bayes’ Optimal Classifier, The Naïve Bayes Classifier \nSelf-learning topics: Collaborative Filtering"
				}
			]
		},
		{
			"name": "Data Science",
			"links": [],
			"chapters": [
				{
					"name": "Introduction Big data overview",
					"links": [],
					"description": "State of the practice in Analytics, Key role for the new big data ecosystem, Examples of big data analytics, the five steps of data science, data science life cycle"
				},
				{
					"name": "Statistical analysis",
					"links": [],
					"description": " What are statistics, how do we obtain sample data, statistics measure, Point estimates,sampling distributions, Confidence intervals, exploratory data analysis, statistical methods for evaluation"
				},
				{
					"name": "Analytical theory and methods 1",
					"links": [],
					"description": "Overview of clustering, K means, additional algorithms, Linear regression, Logistic regression, Reasons to choose and cautions, Addition regression models."
				},
				{
					"name": "Analytical theory and methods 2",
					"links": [],
					"description": "Overview of time series analysis, ARIMA model, Text analysis steps, A text analysis example, Collecting raw text, Representing text, Term frequency, determining sentiments."
				},
				{
					"name": "Fundamentals of R Programming",
					"links": [],
					"description": "Introduction to R studio, Basics of R programming, Math Variables  and Strings, Vectors and Factors, Vector Operations, Reading CSV, Excel, and Built-in Datasets, Reading Text (.txt) files in R, Writing and Saving to files in R, String Operations in R, The Date Format in R, Regular Expressions in R, Packages and libraries, External packages, CRAN, Downloading and installation of desired packages from CRAN."
				}
			]
		}
	]
}
